**`teams/delius-iaps/iaps_server`** terragrunt plan on `pull_request` event [#44](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 2s
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_distribution_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"]: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_recipe.this: Refreshing state... [id=<REDACTED>]
module.imagebuilder.aws_imagebuilder_image_pipeline.this: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/add-net-framework-features/0.2.0/1"
        name                  = "add_net_framework_features"
      ~ tags                  = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_base_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/delius-iaps-install-base-packages/0.1.0/1"
        name                  = "delius_iaps_install_base_packages"
      ~ tags                  = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      ~ tags_all              = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_iaps_install_oracle_db_client_tools.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: delius_iaps_install_oracle_db_client_tools
            description: Installs delius_iaps_install_oracle_db_client_tools
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.0
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
              - S3ArtefactBucket:
                  type: string
                  description: Name of s3 bucket holding software artefacts
            phases:
              - name: build
                steps:
                  - name: GenerateOracleClientRSP
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\oracle\OracleClient.rsp
                        content: |
                          oracle.install.responseFileVersion=/oracle/install/rspfmt_clientinstall_response_schema_v12.1.0
                          UNIX_GROUP_NAME=
                          SELECTED_LANGUAGES=en,en_GB
                          ORACLE_HOME=C:\app\client\Administrator\product\12.1.0\client_1
                          ORACLE_BASE=C:\app\client\Administrator
                          oracle.install.IsBuiltInAccount=true
                          oracle.install.OracleHomeUserName=
                          oracle.install.OracleHomeUserPassword=
                          oracle.install.client.installType=Administrator
                          oracle.install.client.customComponents=
                          oracle.install.client.schedulerAgentHostName=
                          oracle.install.client.schedulerAgentPortNumber=
                        overwrite: false
                  - name: GenerateSQLNETORATMPL
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\oracle\sqlnet.ora
                        content: |
                          SQLNET.AUTHENTICATION_SERVICES = (NTS)
                          NAMES.DIRECTORY_PATH= (TNSNAMES, EZCONNECT)
                        overwrite: false
                  - name: GenerateTNSNAMESORATMPL
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\oracle\tnsnames.ora
                        content: |
                          PCMSSHADOW =
                            (DESCRIPTION =
                              (ADDRESS_LIST =
                                (ADDRESS = (PROTOCOL = TCP)(HOST = iaps-db)(PORT = 1521))
                              )
                              (CONNECT_DATA =
                                (SID = IAPS)
                              )
                            )
            
                          IAPSNR =
                            (DESCRIPTION =
                              (ADDRESS_LIST =
                                (ADDRESS = (PROTOCOL = TCP)(HOST = iaps-db)(PORT = 1521))
                              )
                              (CONNECT_DATA =
                                (SID = IAPS)
                              )
                            )
                        overwrite: false
            
                  - name: DownloadArtefacts
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          Read-S3Object -BucketName {{ S3ArtefactBucket }} -Key "oracle/Oracle_12c_Win32_12.1.0.2.0.7z" -File "${env:TEMP}\oracle\Oracle_12c_Win32_12.1.0.2.0.7z"
            
                  - name: SetupOracleClient
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          try {
                            & "$env:ProgramFiles\7-Zip\7z.exe" "x" "-y" "-o${env:TEMP}\Oracle\Install" "${env:TEMP}\Oracle\Oracle_12c_Win32_12.1.0.2.0.7z"
                          }
                          catch [Exception] {
                            Write-Host ('Failed to extract Oracle client setup using 7z')
                            echo $_.Exception|format-list -force
                            exit 1
                          }
            
                          try {
                            $oaparamfile = "${env:TEMP}\Oracle\Install\Oracle_12c_Win32_12.1.0.2.0\client32\install\oraparam.ini"
                            if (Test-Path -Path $oaparamfile) {
                              ((Get-Content -path $oaparamfile -Raw) -replace 'MSVCREDIST_LOC=vcredist_x64.exe','MSVCREDIST_LOC=vcredist_x86.exe') | Set-Content -Path $oaparamfile
                            } else {
                              write-host('Error - could not find oracle setup param file: $oaparamfile')
                              exit 1
                            }
                            # Create x86 reg entry
                            Push-Location
                            Set-Location 'HKLM:'
                            New-Item -Path '.\SOFTWARE\Wow6432Node' -Name ORACLE -Type Directory -Force
                            New-Itemproperty -Path .\SOFTWARE\Wow6432Node\ORACLE -Name 'inst_loc' -Value 'C:\Program Files (x86)\Oracle\Inventory' -PropertyType 'String'
                            Pop-Location
                          }
                          catch [Exception] {
                            Write-Host ('Failed creating x86 registry entries')
                            echo $_.Exception|format-list -force
                            exit 1
                          }
            
                          try {
                              $oracleanswerfile = "${env:TEMP}\Oracle\OracleClient.rsp"
                              Start-Process -FilePath "${env:TEMP}\Oracle\Install\Oracle_12c_Win32_12.1.0.2.0\client32\setup.exe" -Verb RunAs -ArgumentList "-silent -nowelcome -nowait -noconfig -responseFile $oracleanswerfile 'ORACLE_HOSTNAME=$env:computername'" -Wait
                              if (!(Test-Path C:\app)) {
                                  Write-Host('Error - Something went wrong installing Oracle client - unable to find install path')
                                  exit 1
                              }
                          }
                          catch [Exception] {
                              Write-Host ('Failed installing Oracle Client')
                              echo $_.Exception|format-list -force
                              exit 1
                          }
            
                          Copy-Item "${env:TEMP}\Oracle\tnsnames.ora" -Destination 'C:\app\client\Administrator\product\12.1.0\client_1\network\admin\tnsnames.ora'
                          Copy-Item "${env:TEMP}\Oracle\sqlnet.ora" -Destination 'C:\app\client\Administrator\product\12.1.0\client_1\network\admin\sqlnet.ora'
            
                          Set-ItemProperty -path "HKLM:\SOFTWARE\Wow6432Node\ORACLE\KEY_OraClient12Home1_32bit" -name "NLS_LANG" -value "ENGLISH_UNITED KINGDOM.WE8MSWIN1252"
        EOT
      + date_created = (known after apply)
      + description  = "Installs delius_iaps_install_oracle_db_client_tools"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "delius_iaps_install_oracle_db_client_tools"
      + owner        = (known after apply)
      + platform     = "Windows"
      + tags         = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_install_base_packages-version"          = "0.1.0"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.6"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.6"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + tags_all     = {
          + "add_net_framework_features-version"                 = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"            = "1.0.0"
          + "application"                                        = "DELIUS-IAPS"
          + "branch"                                             = "main"
          + "business-unit"                                      = "HMPPS"
          + "delius_iaps_install_base_packages-version"          = "0.1.0"
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          + "ec2launch-v2-windows-version"                       = "1.0.0"
          + "image-pipeline"                                     = "delius_iaps_server"
          + "image-recipe"                                       = "delius_iaps_server/0.0.6"
          + "infrastructure-configuration"                       = "delius_iaps_server/0.0.6"
          + "is-production"                                      = "true"
          + "os-version"                                         = "windows server 2022"
          + "owner"                                              = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                                   = "patch"
          + "source-code"                                        = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-iaps"
        }
      + type         = (known after apply)
      + version      = "0.1.0"
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/delius-iaps-server"
        name         = "delius_iaps_server"
      ~ tags         = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      ~ tags_all     = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this must be replaced
-/+ resource "aws_imagebuilder_image_pipeline" "this" {
      ~ arn                              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ date_created                     = "2023-01-04T16:30:22.426Z" -> (known after apply)
      ~ date_last_run                    = "2023-01-06T14:39:09.015Z" -> (known after apply)
      ~ date_next_run                    = "2023-02-02T00:00:00.000Z" -> (known after apply)
      ~ date_updated                     = "2023-01-04T16:30:22.426Z" -> (known after apply)
      ~ id                               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-pipeline/delius-iaps-server" -> (known after apply)
      ~ image_recipe_arn                 = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.5" -> (known after apply) # forces replacement
      ~ infrastructure_configuration_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-5" -> (known after apply)
        name                             = "delius_iaps_server"
      ~ platform                         = "Windows" -> (known after apply)
      ~ tags                             = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      ~ tags_all                         = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ schedule {
          + timezone                           = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.5" -> (known after apply)
      ~ date_created      = "2023-01-04T16:30:20.384Z" -> (known after apply)
      ~ id                = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/delius-iaps-server/0.0.5" -> (known after apply)
        name              = "delius_iaps_server"
      ~ owner             = "374269020027" -> (known after apply)
      ~ platform          = "Windows" -> (known after apply)
      ~ tags              = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      ~ tags_all          = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      + user_data_base64  = (known after apply)
      ~ version           = "0.0.5" -> "0.0.6" # forces replacement
      - working_directory = "" -> null
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      - block_device_mapping {
          - device_name = "/dev/xvdf" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - snapshot_id           = "snap-04435aa8246764616" -> null
              - throughput            = 0 -> null
              - volume_size           = 7 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      + component { # forces replacement
          + component_arn = (known after apply) # forces replacement

          + parameter { # forces replacement
              + name  = "S3ArtefactBucket"
              + value = "ec2-image-builder-iaps-artefacts"
            }
        }

      + systems_manager_agent {
          + uninstall_after_build = (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-5" -> (known after apply)
      ~ date_created                  = "2023-01-04T16:30:18.070Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/delius-iaps-server-0-0-5" -> (known after apply)
      ~ name                          = "delius_iaps_server_0_0_5" -> "delius_iaps_server_0_0_6" # forces replacement
      ~ resource_tags                 = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      ~ tags                          = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
      ~ tags_all                      = {
          + "delius_iaps_install_oracle_db_client_tools-version" = "0.1.0"
          ~ "image-recipe"                                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
          ~ "infrastructure-configuration"                       = "delius_iaps_server/0.0.5" -> "delius_iaps_server/0.0.6"
            # (13 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 3 to destroy.

```
